<a href="https://colab.research.google.com/github/Saharsh11/Titanic_ML/blob/master/Titanic_ML_selection.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
from sklearn.model_selection import train_test_split

titanic = pd.read_csv('Titanic_cleaned.csv')
titanic.head()

   Survived  Pclass  ... FamilyCnt  Cabin_in
0         0       3  ...         1         0
1         1       1  ...         1         1
2         1       3  ...         0         0
3         1       1  ...         1         1
4         0       3  ...         0         0

[5 rows x 8 columns]

In [ ]:
titanic['CabinIn'] = titanic['Cabin_in']
titanic.drop(['Cabin_in', 'Name'],axis = 1, inplace = True)
titanic.head()

   Survived  Pclass  ... FamilyCnt  CabinIn
0         0       3  ...         1        0
1         1       1  ...         1        1
2         1       3  ...         0        0
3         1       1  ...         1        1
4         0       3  ...         0        0

[5 rows x 8 columns]

Ideally when testing and pedicting you drop the predicting column and then create a new label for storing predicting values.Here I am not going to drop it instead going to create a new field for storing the new value.

In [ ]:
features = titanic.drop('Survived', axis =1)
features.head()

   Pclass  ... CabinIn
0       3  ...       0
1       1  ...       1
2       3  ...       0
3       1  ...       1
4       3  ...       0

[5 rows x 7 columns]

In [ ]:
labels = titanic['Survived']

x_train, x_test,y_train,y_test = train_test_split(features, labels, test_size = 0.4, random_state = 50)
x_val, x_test,y_val,y_test = train_test_split(x_test, y_test, test_size = 0.5, random_state = 50)

In [ ]:
x_train.to_csv('../Titanic_x_train.csv', index = False)
x_test.to_csv('../Titanic_x_test.csv', index = False)
x_val.to_csv('../Titanic_x_val.csv', index = False)

y_train.to_csv('../Titanic_y_train.csv', index = False)
y_test.to_csv('../Titanic_y_test.csv', index = False)
y_val.to_csv('../Titanic_y_val.csv', index = False)